{
  "1.0.0": {
    "en": "Initial release"
  },
  "1.0.1": {
    "en": "Added Time-Of-Use where you specify StartTime and Hours instead of EndTime. Specify Hours from StartTime instead of EndTime. "
  },
  "1.0.2": {
    "en": "A lot of capabilities added and more configuration."
  },
  "1.0.3": {
    "en": "Link to community added."
  },
  "1.0.4": {
    "en": "Capability adjustments. "
  },
  "1.0.5": {
    "en": "New capabilities added (from/to battery). More conditions added."
  },
  "1.0.6": {
    "en": "Battery level conditions added."
  },
  "1.0.7": {
    "en": "Localization (DA) added."
  },
  "1.0.8": {
    "en": "Translations added."
  },
  "1.0.9": {
    "en": "Hotfix."
  },
  "1.0.10": {
    "en": "Locale update."
  },
  "1.0.11": {
    "en": "GridFeedIn fixture."
  },
  "1.1.0": {
    "en": "mech78 contribution"
  },
  "1.1.1": {
    "en": "Hotfix."
  },
  "1.1.2": {
    "en": "Added support for start-as-string. Packages update."
  },
  "1.1.3": {
    "en": "Start input format fixture."
  },
  "1.2.0": {
    "en": "Widget support"
  },
  "1.2.1": {
    "en": "Widget preview added."
  },
  "1.2.2": {
    "en": "Added auto-discovery of (local) IP."
  },
  "1.2.3": {
    "en": "Hotfixes. Addressed by Tim Bogaert."
  },
  "1.2.4": {
    "en": "Hotfix. Commands not being sent. Added settings on device."
  },
  "1.2.5": {
    "en": "Added DE translations for v1.2.4. Fixes IP change auto-recovery. Fixes homeBattery device config."
  },
  "1.3.0": {
    "en": "Changes to the Energy-tab"
  },
  "1.3.1": {
    "en": "Bring back internal-batteries."
  },
  "1.4.0": {
    "en": "Allow sonnenBatterie to meter imported & exported energy for Energy tab on supported hardware. Fixed measure_power to show charging/discharging as positive/negative values and removing battery charging state."
  },
  "1.5.0": {
    "en": "Fixed multiple energy related meters and better distinction between daily and cumulative meters."
  },
  "1.6.0": {
    "en": "Added support for solar panel and household meter devices, improved grid meter device and derived all values from (mandatory) battery device."
  },
  "1.7.0": {
    "en": "Relocated sonnenBatterie capabilities to solarpanel, household and grid devices. Preserve totals during reinstallations. Known issues: All four devices need to be recreated & household device should be excluded from Energy manually."
  },
  "1.7.1": {
    "en": "Fix solarpanel device regression having omitted meter_power"
  },
  "1.7.2": {
    "en": "Fix widget regression and obtain values from individual devices"
  },
  "1.7.3": {
    "en": "Do not create redundant insights, if possible. Known issues: existing insights need to be deleted manually and for default power measurements it is not possible."
  },
  "1.7.4": {
    "en": "Allow in-place upgrade from v1.3.1 and only add some capabilities if supported by Homey Pro (Early 2023) and later. Hints: Must at least add the sonnenBatterie device. Also be sure to manually exclude the household device from energy. Recreating devices is recommended for proper capability ordering."
  },
  "1.8.0": {
    "en": "Updates. Icons fix."
  },
  "1.8.1": {
    "en": "Driver images."
  },
  "2.0.0": {
    "en": "Time-of-Use improvements, better flow support, allow changing operating mode and to enable forecast charging, added new max/min capabilities, changed to svgrepo icons, localization of error messages, refactorings, fixes battery status capabilities, added roorules, and much more."
  },
  "2.0.1": {
    "en": "Fixed schedule leading/ending trails"
  },
  "2.0.2": {
    "en": "Another Trim fix."
  },
  "2.0.3": {
    "en": "Trim all whitespace from ToU schedule entries."
  }
}
